#include <stdio.h>
#include <stdlib.h>
int main()
{
    int i,j;
    int a[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};
    int *p;//用列指针访问二维数组元素
    p=a;//p=a[0]或者p=&a[0][0]或者p=*a都可以
    printf("用列指针访问二维数组：\n");
    for(i=0;i<3;i++)
    {
        for(j=0;j<4;j++)
        {
            printf("%4d",*(p+i*4+j));//当作一维数组，等价于p[i*4+j]，动态数组访问元素也可以用
        }
    }
    printf("\n");
    int b[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};
    int (*q)[4];//用行指针访问二维数组的元素
    q=b;//q=b[0]或者和q=&b[0][0]或者q=*b都可以
    printf("用行指针访问二维数组：\n");
    for(i=0;i<3;i++)
    {
        for(j=0;j<4;j++)
        {
            printf("%4d",*(*(q+i)+j));//当作二维数组，等价于q[i][j],*(q[i]+j),(*(q+i))[j],将q换成b也可以
        }
    }
    return 0;
}
